---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RemovingReferencesFromGroupedCurve
source: html/bcfca951-22cf-7024-42fa-99349ea16525.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.RemovingReferencesFromGroupedCurve Property

References to elements outside the group were removed from a grouped curve element.

## Syntax (C#)
```csharp
public static FailureDefinitionId RemovingReferencesFromGroupedCurve { get; }
```